tap "homebrew/bundle"

# Shell & prompt
brew "starship"
brew "zsh-completions"

# Git
brew "git"
brew "gh"
brew "lazygit"

# Editor
brew "neovim"
brew "ripgrep"
brew "fd"

# Terminal utilities
brew "fzf"
brew "bat"
brew "eza"
brew "zoxide"
brew "jq"

# Apps
cask "ghostty"
cask "karabiner-elements"
